# Creating Data from Lists or Numpy Array

In [128]:
import pandas as pd

In [132]:
import math
nums = [ x for x in range(1,6)]
numslog = [math.log(x) for x in nums]
numsroot = [float(x) ** 0.5 for x in nums]
nums2 = [x ** 2 for x in nums]
numsnums = [x ** x for x in nums]
datablock = { 'x': nums, 'log_x': numslog, 'root_x': numsroot, 'x^2': nums2, 'x^x': numsnums }
df = pd.DataFrame( data = datablock,
                 index = nums)
#[nums, numslog, numsroot, nums2, numsnums]
df

   x     log_x    root_x  x^2   x^x
1  1  0.000000  1.000000    1     1
2  2  0.693147  1.414214    4     4
3  3  1.098612  1.732051    9    27
4  4  1.386294  2.000000   16   256
5  5  1.609438  2.236068   25  3125

In [106]:
sales = [['Jones and Doe LLC', 150, 200, 50, 89, 114],
         ['Alpha Omega Co', 200, 210, 190, 200,190],
         ['Blue Skies Inc', 140, 215, 95, 77, 70]]
labels = ['FullName', 'Jan', 'Feb', 'Mar','Apr','May']
index=['Jones','Alpha', 'Blue']
df = pd.DataFrame.from_records(sales, index=index,columns=labels)
df = pd.DataFrame(sales, index=index,columns=labels)
df

                FullName  Jan  Feb  Mar  Apr  May
Jones  Jones and Doe LLC  150  200   50   89  114
Alpha     Alpha Omega Co  200  210  190  200  190
Blue      Blue Skies Inc  140  215   95   77   70

In [104]:
sales = [['shortname','FullName', 'Jan', 'Feb', 'Mar','Apr','May'],
         ['Jones','Jones and Doe LLC', 150, 200, 50, 89, 114],
         ['Alpha','Alpha Omega Co', 200, 210, 190, 200,190],
         ['Blue','Blue Skies Inc', 140, 215, 95, 77, 70]]
dataPart = [record[1:] for record in sales[1:] ] # slice off first row and column.
indexPart = [record[0] for record in sales[1:]] # get the index out of first column, but skip first row.
columnsPart = [record for record in sales[0][1:]]  # get the columns from all but the first column of first row
print(indexPart, "\n", columnsPart, "\n", dataPart)
df = pd.DataFrame(dataPart, index=indexPart,columns=columnsPart)
df

['Jones', 'Alpha', 'Blue']
 ['FullName', 'Jan', 'Feb', 'Mar', 'Apr', 'May']
 [['Jones and Doe LLC', 150, 200, 50, 89, 114], ['Alpha Omega Co', 200, 210, 190, 200, 190], ['Blue Skies Inc', 140, 215, 95, 77, 70]]

                FullName  Jan  Feb  Mar  Apr  May
Jones  Jones and Doe LLC  150  200   50   89  114
Alpha     Alpha Omega Co  200  210  190  200  190
Blue      Blue Skies Inc  140  215   95   77   70

In [118]:
sales = [{'shortname': 'Jones', 'FullName': 'Jones and Doe LLC', 'Jan': 150, 'Feb': 200, 'Mar': 50},
         {'shortname': 'Alpha', 'FullName': 'Alpha Omega Co', 'Jan': 200, 'Feb': 210, 'Mar': 190, },
         {'shortname': 'Blue', 'FullName': 'Blue Skies Inc', 'Jan': 140, 'Feb': 215, 'Mar': 95}]
indexPart=[record['shortname'] for record in sales]
sales1 = sales[1]
sales1 = {key: value for (key, value) in sales1.items() if key not in {'shortname'} }
sales = [ {key: value for (key, value) in record.items() if key not in {'shortname'} }  for record in sales]
print(sales)
df = pd.DataFrame(sales, index=indexPart)
df

[{'FullName': 'Jones and Doe LLC', 'Jan': 150, 'Feb': 200, 'Mar': 50}, {'FullName': 'Alpha Omega Co', 'Jan': 200, 'Feb': 210, 'Mar': 190}, {'FullName': 'Blue Skies Inc', 'Jan': 140, 'Feb': 215, 'Mar': 95}]

                FullName  Jan  Feb  Mar
Jones  Jones and Doe LLC  150  200   50
Alpha     Alpha Omega Co  200  210  190
Blue      Blue Skies Inc  140  215   95

In [120]:
sales = [{'shortname': 'Jones', 'FullName': 'Jones and Doe LLC', 'Jan': 150, 'Feb': 200, 'Mar': 50},
         {'shortname': 'Alpha', 'FullName': 'Alpha Omega Co', 'Jan': 200, 'Feb': 210, 'Mar': 190, },
         {'shortname': 'Blue', 'FullName': 'Blue Skies Inc', 'Jan': 140, 'Feb': 215, 'Mar': 95}]
indexPart=[record['shortname'] for record in sales]
df = pd.DataFrame(sales, index=indexPart)
#df = df['FullName', 'Jan', 'Feb', 'Mar']
df

      shortname           FullName  Jan  Feb  Mar
Jones     Jones  Jones and Doe LLC  150  200   50
Alpha     Alpha     Alpha Omega Co  200  210  190
Blue       Blue     Blue Skies Inc  140  215   95

In [111]:
sales = {
'shortname': ['Jones','Alpha','Blue'],
'account': ['Jones and Doe LLC', 'Alpha Omega Co', 'Blue Skies Inc'],
'Jan': [150, 200, 50],
'Feb': [200, 210, 90],
'Mar': [140, 215, 95]}
indexPart=sales['shortname']
del sales['shortname'] # take the index out of the data.
df = pd.DataFrame(sales, index=indexPart)
df

                 account  Jan  Feb  Mar
Jones  Jones and Doe LLC  150  200  140
Alpha     Alpha Omega Co  200  210  215
Blue      Blue Skies Inc   50   90   95

In [121]:
df.columns

Index(['shortname', 'FullName', 'Jan', 'Feb', 'Mar'], dtype='object')

In [123]:
[column for column in df.columns if column not in {'shortname'}]

['FullName', 'Jan', 'Feb', 'Mar']

In [124]:
sales = [{'shortname': 'Jones', 'FullName': 'Jones and Doe LLC', 'Jan': 150, 'Feb': 200, 'Mar': 50},
         {'shortname': 'Alpha', 'FullName': 'Alpha Omega Co', 'Jan': 200, 'Feb': 210, 'Mar': 190, },
         {'shortname': 'Blue', 'FullName': 'Blue Skies Inc', 'Jan': 140, 'Feb': 215, 'Mar': 95}]
indexPart=[record['shortname'] for record in sales]
df = pd.DataFrame(sales, index=indexPart)
df

      shortname           FullName  Jan  Feb  Mar
Jones     Jones  Jones and Doe LLC  150  200   50
Alpha     Alpha     Alpha Omega Co  200  210  190
Blue       Blue     Blue Skies Inc  140  215   95

In [125]:
dfNoShortname = df[ ['FullName','Jan','Feb','Mar'] ]
dfNoShortname

                FullName  Jan  Feb  Mar
Jones  Jones and Doe LLC  150  200   50
Alpha     Alpha Omega Co  200  210  190
Blue      Blue Skies Inc  140  215   95

In [127]:
dfNoShortname = df[  [column for column in df.columns if column not in {'shortname'}]  ]
dfNoShortname

                FullName  Jan  Feb  Mar
Jones  Jones and Doe LLC  150  200   50
Alpha     Alpha Omega Co  200  210  190
Blue      Blue Skies Inc  140  215   95